package Programming.Primitives;

import org.junit.Test;

public class task1_1 {

    //Примитивные типы в Java

    /**
     * task 1.
     * Создать простой Java-проект (консольное приложение), которое при запуске выводит в консоль “Hello, world!”.
     */

    @Test
    public void test1_1() {
        System.out.println("Hello, world!");
    }
}
